'''
Name: Lera
Version: v0.2

Description:    Новая версия. Добавлена нейронная сеть, 
                обученная на датасете "TlkPersonaChatRus"
                (https://toloka.ai/ru/datasets).
                Общение реализуется в режиме реального
                времени, с помощью нейронной сети.

To-Do list:     ( ) - Взаимодействие пользователя и
                программы
                ( ) - Нейронная сеть для общения:
                    ( ) - Приготовление данных для обучения
                    ( ) - Токенизация
                    ( ) - Векторизация
                    ( ) - Конструирование нейронной сети
                    ( ) - Функция обучения
                    ( ) - Функция сохранения весов
                    ( ) - Обучение...
                ### Опциональное: ###
'''

if __name__ == "__main__":
    print("hello world")